<?php
/**
 * 应用设置
 */

return [
    // *******************************************************
    // 应用错误调试部分
    // *******************************************************
    //应用调试模式
    'app_debug'                     => false,
    //出现非致命错误后是否继续运行整个脚本
    'app_error_run'                 => false,
    //默认抛出自定义异常类
    'default_exception_class'       => 'lazy\\LAZYException',


    // *******************************************************
    // 模块，控制器，方法相关设置
    // *******************************************************

    //默认模块
    'default_module'                => 'index',
    //默认控制器
    'default_controller'            => 'index',
    //默认方法名
    'default_method'                => 'index',
    // 当请求方法不存在时候的执行方法名
    'error_default_method'          => '_Error',
    // 当请求控制器不存在的时候的控制器
    'error_default_controller'      => 'Error',
    // 当模块不存在的时候的模块
    'error_default_module'          => 'error',
    // 模块控制器方法返回结果的输出函数定义
    'method_return_print'           => 'print_r',



    // *******************************************************
    // 路由相关设置
    // *******************************************************

    //是否使用路由
    'url_route_on'                  => true,
    // 是否必须使用路由
    'url_route_must'                => false,


    // *******************************************************
    // 模板渲染相关设置
    // *******************************************************

    //模板渲染时是否对输出值进行转义
    'fetch_specialchars'            => true,
    //模板中是否允许执行任意PHP代码
    //修改此项之后需要对模板中任意地方修改以使重新编译才可生效
    'fetch_allow_code'              => false,


    // *******************************************************
    // 用户扩展相关设置
    // *******************************************************

    // 扩展函数文件，已经有app/common.php，如要继续添加，需要在下面配置
    'extra_file_list'               => [],


    // *******************************************************
    // 日志相关设置
    // *******************************************************

    // 日志文件存放路径
    'log_file_path'                 => __LOG_PATH__,
    // 日志文件是否自动清理
    'log_file_autoclear'            => true,
    // 日志文件最长保留时间,单位：月,只有开启自动清理该项才有效
    'log_max_time'                  => 3,
    // 默认时区设置
    'default_timezone'              => 'PRC',

    // *******************************************************
    // cookie相关设置
    // *******************************************************
    'cookie'                        => [
        // cookie 名称前缀
        'prefix'        => '',
        // cookie 保存时间
        'expire'        => 0,
        // cookie 有效域名
        'domain'        => '',
        // cookie 保存路径
        'path'          => __RELATIVE_ROOT_PATH__,
        // 是否启用安全传输
        'secure'        => false,
        // 是否开启httponly
        'httponly'      => false,
    ]
];

